-- Импорт личных сообщений (часть 2: ID 28-47)
INSERT INTO private_messages (id, sender_id, receiver_id, text, is_read, created_at, voice_url, voice_duration) VALUES
(28, 7, 8, 'Сука я пишу', true, '2025-11-30 22:14:55', NULL, NULL),
(29, 7, 8, 'Блять юра нехуя не может чмо', true, '2025-11-30 22:25:09', NULL, NULL),
(30, 8, 7, 'ааа', true, '2025-11-30 22:38:07', NULL, NULL),
(32, 7, 8, 'привет', true, '2025-11-30 22:49:28', NULL, NULL),
(33, 8, 7, 'ghbdtn', true, '2025-11-30 22:55:34', NULL, NULL),
(34, 8, 7, 'Привет', true, '2025-11-30 23:10:42', NULL, NULL),
(35, 7, 8, 'привеь', true, '2025-11-30 23:11:38', NULL, NULL),
(36, 7, 8, 'привет', true, '2025-11-30 23:14:51', NULL, NULL),
(37, 8, 7, 'ввв', true, '2025-11-30 23:23:42', NULL, NULL),
(38, 7, 8, 'Привет шлюха', true, '2025-12-01 12:56:54', NULL, NULL),
(39, 7, 8, 'Привет Лена как дела', true, '2025-12-01 13:09:11', NULL, NULL),
(40, 7, 8, 'Ленка поленка', true, '2025-12-01 13:14:56', NULL, NULL),
(41, 7, 8, 'Ленка', true, '2025-12-01 13:15:39', NULL, NULL),
(42, 8, 7, 'чего', true, '2025-12-01 13:15:58', NULL, NULL),
(43, 7, 8, 'Ленка', true, '2025-12-01 13:19:41', NULL, NULL),
(44, 7, 8, 'Лена', true, '2025-12-01 13:19:56', NULL, NULL),
(45, 7, 8, 'Сучка', true, '2025-12-01 13:20:08', NULL, NULL),
(46, 8, 7, 'сам такой', true, '2025-12-01 13:20:27', NULL, NULL),
(47, 8, 7, 'сука', true, '2025-12-01 13:20:41', NULL, NULL)
ON CONFLICT (id) DO NOTHING;