-- Импорт сообщений из общего чата (часть 1: ID 9-28)
INSERT INTO messages (id, user_id, text, created_at) VALUES
(9, 7, 'эй привет пацики на моциках!!!', '2025-11-30 13:17:56'),
(10, 7, 'Всем доброго вечера', '2025-11-30 13:46:22'),
(11, 7, 'Эй', '2025-11-30 14:45:31'),
(12, 7, 'Есть кто?', '2025-11-30 14:49:41'),
(13, 7, 'Есть кто из ЕКБ дружба общение', '2025-11-30 14:51:06'),
(14, 7, 'Есть красивые девушки которые не ведут плохой образ жизни?', '2025-11-30 14:54:25'),
(15, 7, 'Я из екб пообщаемся', '2025-11-30 14:58:12'),
(16, 7, 'Ок', '2025-11-30 14:58:32'),
(17, 7, 'Тук тук тук', '2025-11-30 15:44:44'),
(18, 7, 'Эй додики', '2025-11-30 15:44:57'),
(19, 7, 'Ауууу', '2025-11-30 15:45:02'),
(20, 7, 'суки', '2025-11-30 15:55:07'),
(21, 7, 'сука', '2025-11-30 16:01:49'),
(22, 7, 'блядь', '2025-11-30 16:02:43'),
(23, 7, 'Эй', '2025-11-30 16:24:12'),
(24, 7, 'Скачать сто так', '2025-11-30 16:26:56'),
(25, 7, 'Скачать тебя в зад', '2025-11-30 16:31:41'),
(26, 7, 'ппп', '2025-11-30 17:10:25'),
(27, 7, 'ррр', '2025-11-30 17:10:34'),
(28, 7, 'нехуя', '2025-11-30 17:12:49')
ON CONFLICT (id) DO NOTHING;